/** @jsx React.DOM */
var appConstants = {
	CHANGE_SEARCH: "CHANGE_SEARCH",
	UPDATE_MONTH: "UPDATE_MONTH",
	SELECT_DAY: "SELECT_DAY",
	ADD_TASK: "ADD_TASK",
	DELETE_TASK: "DELETE_TASK"
};
var _months=["Январь","Февраль","Март","Апрель","Май","Июнь","Июль","Август","Сентябрь","Октябрь","Ноябрь","Декабрь"];
var _monthsRelative=["Январь"=>"Января","Февраль"=>"Февраля","Март"=>"Марта","Апрель"=>"Апреля","Май"=>"Мая","Июнь"=>"Июня","Июль"=>"Июля","Август"=>"Августа","Сентябрь"=>"Сентября","Октябрь"=>"Октября","Ноябрь"=>"Ноября","Декабрь"=>"Декабря"];